# = не копирует
a = [1, 2, 3] #создаем список, a - имя списка
b = a #второе имя списка
print(a, b) #оба показывают [1, 2, 3]
b.append(4) #меняем список
print(a, b) #a и b показывают [1, 2, 3, 4]
# +=  создает новый объект
s1 = "hello" #s1 указывает на строку
s2 = s1 #s2 указывает на ту же строку
print(s1, s2) #выведется 2 строки hello
s2 += "hello" #добавляется hello
print(s1, s2) #выведется hello, hello hello
# == и is
a1 = [1, 2, 3] #первый список
a2 = a1 # a2 это ссылка на первый список
print(f"a1 == a2: {a1 == a2}") #True, поттому что их содержимое одинаковые
print(f"a1 is a2: {a1 is a2}") #False, потому что это два разных лбъекта
